
"""
Дан одновимірний масив з 10 цілих чисел. Підрахуйте найбільше число однакових чисел, що йдуть підряд в ньому.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np


answer = '1'
while answer == '1':

    """ array - масив із 10 заданих цілих чисел.
    amount - змінна, яка підраховує довжини послідовностей з однакових чисел у масиві array.
    max_sequence - довжина найдовшої послідовності з однакових чисел.
    max_sequence_num - число, з якого складається найдовша послідовність однакових чисел. """
    array, amount, max_sequence, max_sequence_num = np.zeros(10, dtype=int), 1, 0, 0

    print("Введіть масив з 10 цілих чисел:")
    for i in range(10):  # Введення даних у масив array
        while True:
            try:
                item = int(input())
                break
            except ValueError:
                print("Вводьте правильні дані!")
        array[i] = item

    print("Заданий масив чисел дорівнює: ", end="")
    for i in range(10):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 9:
            print(", ", end="")
        else:
            print(".")

        if array[i] == array[i - 1] and i != 0 and i != 9:  # Підрахунок довжин послідовностей з однакових чисел
            amount += 1  # Якщо поточний елемент збігається з попереднім, то довжина послідовності збільшується на 1

            """ Якщо збігу не відбувається і довжина послідовності більша за одиницю (тобто це не одне число, 
            а саме послідовність чисел), то вважається, що довжина послідовності з однакових чисел знайдена. """
        elif amount > 1:

            """ Оскільки після 9-того елемента проходження масиву завершується, то послідовність чисел, яка 
            завершується останнім елементом масиву, може не розглянутись, і тому в попередньому if-і пропускається 
            останній елемент масиву, щоб код перейшов у цей elif і подібна послідовність чисел почала розглядатися. 
            Також підрахунок останнього елементу подібної послідовності переноситься у elif: """
            if array[i] == array[i - 1]:
                amount += 1

            if max_sequence < amount:  # Пошук найдовшої послідовності з однакових чисел
                max_sequence = amount
                max_sequence_num = array[i - 1]

            # Після розгляду послідовності з однакових чисел змінна amount повертається до свого початкового значення
            amount = 1

    print(f"Найдовшою послідовністю однакових чисел, що йдуть підряд, у заданому масиві "
          f"є послідовність з {max_sequence} чисел {max_sequence_num}.")

    answer = input("Введіть '1' для повторення:")
