
"""
Знайти добуток всіх елементів масиву дійсних чисел, менших заданого числа.
Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами від 50 до 100.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    """ array - масив із 20 випадкових дійсних чисел від 50 до 100.
    (Для створення масиву випадкових дійсних чисел використовується функція numpy.random.uniform(). Так як створені 
    таким чином числа мають занадто велику частину після крапки, то використовується функція map() з виконанням функції 
    round() для її скорочення. Оскільки повертається об'єкт типу map, який не розпізнається функцією numpy.array(), 
    то спочатку об'єкт перетворюється у список за допомогою list(), а вже потім застосовується numpy.array() для 
    перетворення у масив.)
    num_product - добуток всіх елементів масиву array, менших за задане число number. """
    array, num_product = np.array(list(map(lambda x: round(x, 2), np.random.uniform(50, 100, 10)))), 1

    while True:  # Введення числа number
        try:
            number = float(input("Введіть число:"))
            break
        except ValueError:
            print("Вводьте правильні дані!")

    print("Послідовність з 10 випадкових дійсних чисел від 50 до 100 дорівнює: ", end="")
    for i in range(10):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 9:
            print(", ", end="")

        if array[i] < number:  # Знаходження суми всіх елементів масиву array, менших за задане число number
            num_product *= array[i]
    """ Для проведення підрахунку добутку початкове значення num_product має дорівнювати одиниці. Якщо масив не містить 
    в собі чисел, менших заданого числа number, то добуток залише значення 1, якій добуток не має дорівнювати, тому, 
    оскільки масив не може мати в собі одиницю, відбувається перевірка на рівність num_product одиниці та вивід 
    відповідного тексту."""
    if num_product == 1:
        print(f"\nЦя послідовність не включає в собі чисел, менших за число {number}.")
    else:
        print(f"\nДобуток всіх чисел послідовності, менших за число {number}, дорівнює: {round(num_product, 2)}")

    answer = input("Введіть '1' для повторення:")
