
"""
Наведено список прізвищ брокерів товарної біржі з N чоловік. Поміняйте місцями прізвища брокерів: першого і останнього,
другого і передостаннього, третього з початку і третього від кінця і т.д.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np


answer = '1'
while answer == '1':


    while True:  # Введення значення змінної N, яка стане довжиною лінійного масиву array
        try:
            N = int(input("Введіть число введених прізвищ:"))
            if N > 0:
                break
            else:
                print("Вводьте правильні дані!")
        except ValueError:
            print("Вводьте правильні дані!")

    array = np.zeros(N, dtype='<U20')  # array - масив із N заданих рядків довжиною 20 символів

    print(f"Введіть послідовність з {N} прізвищ брокерів товарної біржі (максимум 20 символів в одному прізвищі):")
    for i in range(N):  # Введення даних у масив array
        array[i] = input()

    for i in range(N // 2):  # Обмін місцями відповідних перших та останніх елементів масиву array
        array[i], array[-i-1] = array[-i-1], array[i]

    print("Список заданих прізвищ у зворотньому порядку дорівнює: ")
    for i in range(N):  # Виведення даних масиву array
        print(f"- {array[i]};")

    answer = input("Введіть '1' для повторення:")
