
"""
Створіть масив з п'яти прізвищ і виведіть на екран ті з них, які починаються з певної букви, яка вводиться з клавіатури.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np


answer = '1'
while answer == '1':

    array = np.zeros(5, dtype='<U20')  # array - масив із 5 заданих рядків довжиною 20 символів

    print("Введіть послідовність з 5 прізвищ (максимум 20 символів в одному прізвищі):")
    for i in range(5):  # Введення даних у масив array
        array[i] = input()

    # letter - задана літера. Дані масиву array, що починаються на letter, будуть виведені
    letter = input("Введіть літеру:")
    letter = letter[0]  # Якщо користувач введе рядок з декількох символів, то візьметься тільки перший з них

    print("Список заданих прізвищ, що починаються з цієї літери, дорівнює: ")
    for i in range(5):  # Виведення даних масиву array, що починаються заданою літерою
        if array[i][0] == letter:
            print(array[i])

    answer = input("Введіть '1' для повторення:")
