
"""
У лінійному масиві знайти максимальний елемент.
Вставте порядковий номер елемента за ним, пересунувши всі наступні елементи на одну позицію вправо.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    while True:  # Введення значення змінної n, від якої залежатиме довжина лінійного масиву array
        try:
            n = int(input("Введіть довжину послідовності чисел:"))
            if n > 0:
                break
            else:
                print("Вводьте правильні дані!")
        except ValueError:
            print("Вводьте правильні дані!")

    """ array - масив із n+1 випадкових цілих чисел від 0 до 100. Останній елемент масиву не розглядається, 
    а його позиція використовується для вставки нового елемента, що є номером максимального елементу масиву array.
    
    max_num - максимальний елемент масиву array.
    max_num_index - номер максимального елементу масиву array. """
    array, max_num, max_num_index = np.random.randint(0, 100, n + 1), 0, 0

    print(f"Послідовність з {n} випадкових чисел дорівнює: ", end="")
    for i in range(n):  # Виведення даних масиву array, окрім останнього елементу

        print(array[i], end="")
        if i != n-1:
            print(", ", end="")
        else:
            print(".")

        if max_num < array[i]:  # Знаходження максимального елементу масиву array
            max_num = array[i]
            max_num_index = i

    print(f"Максимальне число послідовності дорівнює {max_num}, яке має номер {max_num_index}.")

    """ Вставка номеру максимального елементу масиву array перед самим максимальним елементом 
    та зсув всіх наступних елементів на одну позицію вправо. """
    for i in range(n, max_num_index, -1):
        array[i-1], array[i] = array[i], array[i-1]
    array[max_num_index] = max_num_index

    print(f"Послідовність з {n} випадкових чисел, у якій перед максимальним елементом "
          "вставили його номер, дорівнює: ", end="")
    for i in range(n+1):  # Виведення даних масиву array
        print(array[i], end="")
        if i != n:
            print(", ", end="")
        else:
            print(".")

    answer = input("Введіть '1' для повторення:")
