
"""
Знайти суму елементів масиву дійсних чисел, що мають непарні номери.
Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 100 до 200.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    """ array - масив із 20 випадкових дійсних чисел від 100 до 200.
    (Для створення масиву випадкових дійсних чисел використовується функція numpy.random.uniform(). Так як створені 
    таким чином числа мають занадто велику частину після крапки, то використовується функція map() з виконанням функції 
    round() для її скорочення. Оскільки повертається об'єкт типу map, який не розпізнається функцією numpy.array(), 
    то спочатку об'єкт перетворюється у список за допомогою list(), а вже потім застосовується numpy.array() для 
    перетворення у масив.)
    num_sum - сума всіх елементів масиву array, що мають непарні номери. """
    array, num_sum = np.array(list(map(lambda x: round(x, 2), np.random.uniform(100, 200, 20)))), 0

    print("Послідовність з 20 випадкових чисел від 100 до 200 дорівнює: ", end="")
    for i in range(20):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 19:
            print(", ", end="")

        if i % 2 != 0:  # Підрахунок значення num_sum
            num_sum += array[i]
    # Виведення значення num_sum
    print(f"\nСума всіх чисел послідовності, що мають непарні номери, дорівнює: {num_sum}")

    answer = input("Введіть '1' для повторення:")
