
"""
Якщо в одновимірному масиві є три поспіль однакових елемента, то змінній r привласнити значення істина.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    """ array - масив із 20 випадкових цілих чисел від 0 до 20.
    r - змінна, яка є істинною, якщо у масиві array є три однакових числа, які йдуть поспіль.
    sequence - змінна, яка підраховує кількість однакових елементів масиву array, що йдуть підряд. """
    array, r, sequence = np.random.randint(0, 20, 20), False, 1

    print("Послідовність з 20 випадкових чисел дорівнює: ", end="")
    for i in range(20):
        print(array[i], end="")  # Виведення даних масиву array
        if i != 19:
            print(", ", end="")
        else:
            print(".")

        # Підрахунок однакових елементів масиву array, що йдуть підряд
        if array[i] == array[i - 1] and i != 0 and not r:  # Підрахунок відбувається поки змінна r не стане істинною
            sequence += 1  # Показник sequence збільшується, якщо поточний елемент дорівнює попередньому
        elif sequence != 1 and not r:
            sequence = 1  # Показнику sequence присвоюється одиниця, якщо збігу не відбувається

        if sequence >= 3:  # Якщо є три однакових числа, що йдуть поспіль, то змінна r стає істинною
            r = True

    if r:
        print("Послідовність з випадкових чисел містить в собі три однакових числа, що йдуть поспіль.")
    else:
        print("Послідовність з випадкових чисел не містить в собі трьох однакових чисел, що йдуть поспіль.")

    answer = input("Введіть '1' для повторення:")
