
"""
Дан одновимірний масив а. Сформувати новий масив, який складається тільки з тих елементів масиву а,
які перевищують свій номер на 10. Якщо таких елементів немає, то видати повідомлення.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np


answer = '1'
while answer == '1':

    a, amount = np.zeros(10, dtype=int), 0  # a - масив із 10 заданих цілих чисел
    # amount - кількість чисел масиву a, які більші за свій номер як мінімум на 10

    print("Введіть послідовність з 10 цілих чисел:")
    for i in range(10):  # Введення даних у масив a
        while True:
            try:
                item = int(input())
                break
            except ValueError:
                print("Вводьте правильні дані!")
        a[i] = item

        if item >= i + 10:  # Підрахунок значення amount
            amount += 1

    print("Задана послідовність чисел дорівнює: ", end="")
    for i in range(10):  # Виведення даних масиву array
        print(a[i], end="")
        if i != 9:
            print(", ", end="")
        else:
            print(".")

    if amount != 0:

        # array - масив, що складається з чисел масиву a, які більші за свій номер як мінімум на 10
        array = np.zeros(amount, dtype=int)
        j = 0
        for i in range(10):  # Заповнення масиву array відповідними числами масиву a
            if a[i] >= i + 10:
                array[j] = a[i]
                j += 1

        print("Список з чисел заданої послідовності, які більші за свій номер як мінімум на 10, дорівнює: ", end="")
        for i in range(amount):  # Виведення даних масиву array
            print(array[i], end="")
            if i != amount - 1:
                print(", ", end="")
            else:
                print(".")

    else:
        print("Задана послідовність не містить в собі чисел, які більші за свій номер як мінімум на 10.")

    answer = input("Введіть '1' для повторення:")
