
"""
Обчислити суму парних елементів одновимірного масиву до першого зустрінутого нульового елемента.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    """ array - масив із 30 випадкових цілих чисел від 0 до 50.
    even_num_sum - сума всіх парних елементів масиву array до першого зустрінутого нульового елемента.
    zero - змінна, при істинності якої відбувається підрахунок even_num_sum і яка отримує значення хиби, 
    коли зустрічається  нульовий елемент. """
    array, even_num_sum, zero = np.random.randint(0, 50, 30), 0, True

    print("Послідовність з 30 випадкових чисел від 0 до 50 дорівнює: ", end="")
    for i in range(30):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 29:
            print(", ", end="")
        else:
            print(".")

        # Підрахунок значення even_num_sum
        if array[i] == 0:  # Якщо поточний елемент є нульовим, то підрахунок завершується
            zero = False
        if array[i] % 2 == 0 and zero:
            even_num_sum += array[i]
    # Виведення значення even_num_sum
    print(f"Сума всіх парних чисел послідовності до першого зустрінутого нуля дорівнює: {even_num_sum}")

    answer = input("Введіть '1' для повторення:")
