
"""
Створіть масив з п'яти прізвищ і виведіть їх на екран стовпчиком, починаючи з останнього.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np


answer = '1'
while answer == '1':

    array = np.zeros(5, dtype='<U20')  # array - масив із 5 заданих рядків довжиною 20 символів

    print("Введіть послідовність з 5 прізвищ (максимум 20 символів в одному прізвищі):")
    for i in range(5):  # Введення даних у масив array
        array[i] = input()

    print("Список заданих прізвищ у зворотньому порядку дорівнює: ")
    for i in range(5 - 1, -1, -1):  # Виведення даних масиву array у зворотньому порядку
        print(array[i])

    answer = input("Введіть '1' для повторення:")

