
"""
Знайти добуток всіх елементів масиву цілих чисел, менших 0.
Розмірність масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np


answer = '1'
while answer == '1':

    """ array - масив із 10 заданих цілих чисел.
    negative_num_product - добуток елементів масиву array, менших 0.
    
    Для проведення підрахунку добутку початкове значення negative_num_product має дорівнювати одиниці.
    Якщо масив не містить в собі чисел, менших 0, то добуток залише значення одиниці, якій добуток не має дорівнювати. 
    Так як значення 1 може отриматись при наявності у масиві двох чисел -1, то для перевірки, того, 
    чи відбулось множення, використовується змінна is_multiplied. """
    array, negative_num_product, is_multiplied = np.zeros(10, dtype=int), 1, False

    print("Введіть послідовність з 10 цілих чисел:")
    for i in range(10):   # Введення даних у масив array
        while True:
            try:
                item = int(input())
                break
            except ValueError:
                print("Вводьте правильні дані!")
        array[i] = item


    print("Задана послідовність чисел дорівнює: ", end="")
    for i in range(10):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 9:
            print(", ", end="")

        if array[i] < 0:  # Підрахунок значення negative_num_product
            negative_num_product *= array[i]
            is_multiplied = True  # Якщо відбулось хоча б одне множення значення is_multiplied стає істинним

    if is_multiplied:  # Виведення відповідного тексту в залежності від значення is_multiplied
        print(f"\nДобуток всіх елементів послідовності чисел, менших 0, дорівнює: {negative_num_product}")
    else:
        print("\nЦя послідовність не включає в собі чисел, менших 0.")

    answer = input("Введіть '1' для повторення:")
