
"""
З 8 до 20 години температура повітря вимірювалася щогодини. Відомо, що протягом цього часу температура знижувалася.
Визначте, о котрій годині було вперше зафіксовано від'ємну температуру.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np
import random

answer = '1'
while answer == '1':

    """ array - масив, що містить результати щогодинного вимірювання температури повітря з 8 до 20 години.
    hour - година о котрій було вперше зафіксовано від'ємну температуру. """
    array, hour = np.zeros(13), 0

    """ Визначення даних масиву array, в якому перший елемент - випадкове ціле число від 10 до 30, 
    а решта елементів - числа, що менші від значень попередніх елементів на 1-3 одиниці."""
    array[0] = random.randint(10, 30)
    for i in range(1, 13):
        array[i] = array[i-1] - random.randint(1, 3)

    print("Список температур повітря, що вимірювалися щогодини з 8 до 20: ")
    for i in range(13):  # Виведення даних масиву array
        print(f"{i+8} година: {array[i]} °C")

        if array[i] < 0 and hour == 0:  # Знаходження значення змінної hour
            hour = i + 8

    if hour == 0:  # Виведення значення змінної hour
        print("Від'ємна температура не була зафіксована протягом вимірювань.")
    else:
        print(f"Вперше від'ємна температура була зафіксована о {hour} годині.")

    answer = input("Введіть '1' для повторення:")
