"""
Задано два натуральних числа a і b. Змінній w привласнити значення істина,
якщо в одновимірному цілочисельному масиві є хоча б один елемент, кратний а і не кратний b.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    """ array - масив із 20 випадкових цілих чисел від 1 до 50.
    w - змінна, яка приймає значення істинності, якщо в масиві array є хоча б один елемент, 
    кратний заданому числу а і не кратний заданому числу b. """
    array, w = np.random.randint(1, 50, 20), False

    while True:  # Введення числа а
        try:
            a = int(input("Введіть перше ціле число:"))
            break
        except ValueError:
            print("Вводьте правильні дані!")

    while True:  # Введення числа b
        try:
            b = int(input("Введіть друге ціле число:"))
            break
        except ValueError:
            print("Вводьте правильні дані!")

    print("Послідовність з 20 випадкових чисел дорівнює: ", end="")
    for i in range(20):  # Виведення даних масиву array

        if array[i] % a == 0 and array[i] % b != 0:  # Знаходження числа, яке кратне числу а і не кратне числу b
            w = True
            print(f"!{array[i]}!", end="")  # Виділення при виведенні чисел, які кратні числу а і не кратні числу b
        else:
            print(array[i], end="")

        if i != 19:
            print(", ", end="")
        else:
            print(".")

    if w:  # Вивід відповідного тексту
        print(f"Ця послідовність містить у собі хоча б одне число, яке кратне числу {a} і не кратне числу {b}.")
    else:
        print(f"Ця послідовність не містить у собі ні одного числа, яке кратне числу {a} і не кратне числу {b}.")

    answer = input("Введіть '1' для повторення:")
