
"""
Дані про температуру повітря за декаду листопада зберігаються в масиві.
Визначити, скільки разів температура опускалася нижче -10 градусів.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    """ array - масив, що містить результати щоденного вимірювання температури повітря протягом листопада.
    Значення array - 30 випадкових чисел від -20 до 20.
   amount - кількість разів, коли протягом місяця температура опускалася нижче -10 градусів. """
    array, amount = np.random.randint(-20, 20, 30), 0

    print("Список температур повітря, що вимірювались щоденно протягом місяця листопада: ")
    for i in range(30):  # Виведення даних масиву array
        print(f"{i + 1} листопада: {array[i]} °C")
        if array[i] < -10:  # Підрахунок значення amount
            amount += 1
    print(f"Протягом місяця температура опускалася нижче -10 градусів {amount} разів.")  # Виведення значення amount

    answer = input("Введіть '1' для повторення:")
