
"""
Сформуйте лінійний масив дійсних чисел, елементи якого є відстанями,
пройденими тілом при вільному падінні на землю за 1, 2, ..., 10 с.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

# array - масив, що зберігає значення відстаней, які проходить тіло при вільному падінні за час від 1 до 10 секунд
array = np.zeros(10)

print("Відстані, які проходить тіло при вільному падінні за час від 1 до 10 секунд: ")
for t in range(1, 11):
    array[t - 1] = round(9.8 * (t ** 2) / 2, 1)  # Знаходження значення масиву array

    print(f"За {t} с: {array[t - 1]} м")  # Виведення даних масиву array
