
"""
Знайти суму всіх елементів масиву цілих чисел що задовольняють умові: остача від ділення на 2 дорівнює 3.
Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 200 до 300.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    """ array - масив із 20 випадкових цілих чисел від 200 до 300.
    num_sum - сума всіх елементів масиву array, остача від ділення яких на 2 дорівнює 3. """
    array, num_sum = np.random.randint(200, 300, 20), 0

    print("Послідовність з 20 випадкових чисел від 200 до 300 дорівнює: ", end="")
    for i in range(20):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 19:
            print(", ", end="")

        if array[i] % 2 == 3:  # Підрахунок значення num_sum
            num_sum += array[i]
    # Виведення значення num_sum
    print(f"\nСума всіх чисел послідовності, остача від ділення яких на 2 дорівнює 3, дорівнює: {num_sum}")

    answer = input("Введіть '1' для повторення:")
