
"""
Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8 одночасно.
Розмірність масиву - 30. Заповнення масиву здійснити випадковими числами від 500 до 1000.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    array, num_sum = np.random.randint(500, 1000, 30), 0  # array - масив із 30 випадкових цілих чисел від 500 до 1 000
    # num_sum - сума елементів масиву array, які діляться на 5 і на 8 одночасно

    print("Послідовність з 30 випадкових чисел від 500 до 1000 дорівнює: ", end="")
    for i in range(30):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 29:
            print(", ", end="")

        if array[i] % 5 == 0 and array[i] % 8 == 0:  # Знаходження значення num_sum
            num_sum += array[i]
    print(f"\nСума всіх чисел послідовності, які діляться на 5 і на 8 одночасно, дорівнює: {num_sum}")

    answer = input("Введіть '1' для повторення:")
