
"""
Дані про температуру повітря за декаду грудня зберігаються в масиві.
Визначити, скільки раз температура була вище середньої за цю декаду.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    """ array - масив, що містить результати щоденного вимірювання температури повітря протягом грудня. 
    Значення array - 31 випадкове число від -30 до 10.
    average_temp - значення середньої температури за грудень.
    amount - кількість разів, коли протягом місяця температура була вище середньої за грудень."""
    array, average_temp, amount = np.random.randint(-30, 10, 31), 0, 0

    print("Список температур повітря, що вимірювались щоденно протягом місяця грудня: ")
    for i in range(31):  # Виведення даних масиву array
        print(f"{i+1} грудня: {array[i]} °C")

        average_temp += array[i]
    average_temp = round(average_temp / 31, 1)  # Знаходження середньої температури за місяць

    for i in range(31):  # Підрахунок значення amount
        if array[i] > average_temp:
            amount += 1

    # Виведення значення average_temp і amount
    print(f"Середня температура повітря за місяць грудень дорівнює: {average_temp}.\n"
          f"Протягом місяця температура повітря ставала вищою середньої за цю декаду {amount} разів.")

    answer = input("Введіть '1' для повторення:")
