"""
Знайти кількість парних елементів одновимірного масиву до першого зустрінутого числа рівного наперед заданому числу а.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    array, even_num = np.random.randint(1, 100, 20), 0  # array - масив із 20 випадкових цілих чисел від 1 до 100
    # even_num - кількість парних елементів масиву array до першого зустрінутого числа рівного заданому числу а

    print("Послідовність з 20 випадкових чисел дорівнює: ", end="")
    for i in range(20):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 19:
            print(", ", end="")
        else:
            print(".")

    # Введення числа a. Кількість парних елементів масиву array підраховується до першого зустрінутого числа a
    while True:
        try:
            a = int(input("Введіть число:"))
            break
        except ValueError:
            print("Вводьте правильні дані!")

    for i in range(20):  # Підрахунок значення even_num
        if array[i] == a:  # Коли зустрічається перше входження числа a підрахунок припиняється
            break
        if array[i] % 2 == 0:
            even_num += 1

    # Виведення значення even_num
    print(f"Кількість всіх парних чисел послідовності, до числа {a}, дорівнює: {even_num}")

    answer = input("Введіть '1' для повторення:")
