
"""
Створіть масив з 15 цілочисельних елементів і визначте серед них мінімальне значення.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    array, min_num = np.random.randint(-20, 20, 15), 0  # array - масив із 15 випадкових цілих чисел від -20 до 20
    # min_num - мінімальний елемент масиву array

    print("Послідовність з 15 випадкових цілих чисел дорівнює: ", end="")
    for i in range(15):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 14:
            print(", ", end="")

        if array[i] < min_num:  # Знаходження найменшого елемента масиву array
            min_num = array[i]
    print(f"\nМінімальне число з послідовності дорівнює: {min_num}")  # Виведення мінімального елемента масиву array

    answer = input("Введіть '1' для повторення:")
