
"""
Знайти добуток елементів лінійного масиву цілих чисел, які кратні 5.
Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами від 10 до 100.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    array, num_product = np.random.randint(10, 100, 10), 1  # array - масив із 10 випадкових цілих чисел від 10 до 100
    # num_product - добуток елементів масиву array, які кратні 5

    print("Послідовність з 10 випадкових чисел від 10 до 100 дорівнює: ", end="")
    for i in range(10):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 9:
            print(", ", end="")

        if array[i] % 5 == 0:  # Підрахунок значення num_product
            num_product *= array[i]
    """ Для проведення підрахунку добутку початкове значення num_product має дорівнювати одиниці.
    Якщо масив не містить в собі чисел, кратних 7, то добуток залише значення 1, яке не допустиме, тому
    відбувається перевірка на рівність num_product одиниці та вивід відповідного тексту."""
    if num_product == 1:
        print("\nЦя послідовність не включає в собі чисел, кратних 5.")
    else:
        print(f"\nДобуток всіх чисел послідовності, кратних 5, дорівнює: {num_product}")

    answer = input("Введіть '1' для повторення:")
