
"""
Дані про температуру води на Чорноморському узбережжі за декаду вересня зберігаються в масиві.
Визначити, скільки за цей час було днів, придатних для купання.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    """ array - масив, що містить результати щоденного вимірювання температури води на Чорноморському узбережжі 
    протягом вересня. Значення array - 30 випадкових чисел від -10 до 30.
    amount - кількість разів, коли протягом місяця температура води ставала придатною для купання (від 17 градусів)."""
    array, amount = np.random.randint(-10, 30, 30), 0

    print("Список температур морської води, що вимірювались щоденно протягом місяця вересня: ")
    for i in range(30):  # Виведення даних масиву array
        print(f"{i+1} вересня: {array[i]} °C")
        if array[i] >= 17:  # Підрахунок значення amount
            amount += 1

    # Виведення значення amount
    print(f"Протягом місяця температура води ставала придатною для купання {amount} разів.")

    answer = input("Введіть '1' для повторення:")
