
"""
Дані про направлення вітру (північний, південний, східний, західний) і силі вітру за декаду листопада
зберігаються в масиві. Визначити, скільки днів дув південний вітер з силою, що перевищує 8 м / с.

Виконав Іваненко Андрій Вадимович
"""


import numpy as np
import random

answer = '1'
while answer == '1':

    """ array - масив, що містить дані про направлення вітру і силу вітру за місяць листопад. array - масив, 
    що зберігає дані рядкового типу до 10 символів, розмірності (2:30), де перший рядок є послідовністю з 
    напрямків вітру, випадково вибраних з 4 варіантів, а другий рядок - послідовність значень сили вітру, 
    що є випадковими числами від 0 до 30.
    
    amount - кількість разів, коли протягом місяця дув південний вітер з силою, що перевищує 8 м/с."""
    array, amount = np.zeros((2, 30), dtype='<U10'), 0

    for i in range(30):  # Визначення даних масиву array
        rnd = random.randint(1, 4)
        if rnd == 1:
            array[0][i] = 'північний'
        elif rnd == 2:
            array[0][i] = 'південний'
        elif rnd == 3:
            array[0][i] = 'східний'
        elif rnd == 4:
            array[0][i] = 'західний'

        rnd = random.randint(0, 30)
        array[1][i] = str(rnd)

    print("Список значень направлення і сили вітру, що вимірювались щоденно протягом місяця листопада: ")
    for i in range(30):  # Виведення даних масиву array
        print(f"{i + 1} листопада: {array[1][i]} м/с ({array[0][i]} вітер).")

        if int(array[1][i]) > 8 and array[0][i] == 'південний':  # Підрахунок значення amount
            amount += 1
    # Виведення значення amount
    print(f"Протягом місяця кількість днів, коли дув південний вітер з силою, що перевищує 8 м/с, дорівнює {amount}.")

    answer = input("Введіть '1' для повторення:")