
"""
Створіть масив А [1..12] за допомогою генератора випадкових чисел з елементами від -20 до 10 і виведіть його на екран.
Замініть всі від’ємні елементи масиву числом 0.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    array = np.random.randint(-20, 10, 12)  # array - масив із 12 випадкових цілих чисел від -20 до 10

    print("Послідовність з 12 випадкових чисел від -20 до 10 дорівнює: ", end="")
    for i in range(12):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 11:
            print(", ", end="")
    print(f"\nПослідовність з випадкових чисел, в якій всі від’ємні елементи замінені на 0, дорівнює: ", end="")
    for i in range(12):  # Виведення даних масиву array, в якому всі від’ємні елементи замінені числом 0
        if array[i] < 0:
            array[i] = 0
        print(array[i], end="")
        if i != 11:
            print(", ", end="")

    answer = input("\nВведіть '1' для повторення:")
