
"""
Створіть масив А [1..8] за допомогою генератора випадкових чисел з елементами від -10 до 10 і виведіть його на екран.
Підрахуйте кількість від’ємних елементів масиву.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    array, amount = np.random.randint(-10, 10, 8), 0  # array - масив із 8 випадкових цілих чисел від -10 до 10
    # amount - змінна, яка зберігає дані про кількість від’ємних елементів масиву array

    print("Послідовність з 8 випадкових чисел від -10 до 10 дорівнює: ", end="")
    for i in range(8):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 7:
            print(", ", end="")
        if array[i] < 0:  # Підрахунок кількості від’ємних елементів масиву array
            amount += 1
    print(f"\nКількість від'ємних чисел з них дорвінює: {amount}.")  # Виведення значення змінної amount

    answer = input("Введіть '1' для повторення:")
