
"""
У будинку, що складається з 30 квартир, переселити мешканців так, щоб мешканці першої квартири переїхали в тридцяту,
з тридцятого - в першу, з другої - в 29 і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np


answer = '1'
while answer == '1':

    array, amount = np.zeros(30, dtype=int), 0  # array - масив із 30 заданих цілих чисел
    # amount - кількість квартир, в яких проживає більше ніж 5 осіб

    print("Введіть кількість мешканців для кожної з 30 квартир будинку:")
    for i in range(30):  # Введення даних у масив array
        while True:
            try:
                item = int(input())
                break
            except ValueError:
                print("Вводьте правильні дані!")
        array[i] = item

        if item > 5:  # Підрахунок значення змінної amount
            amount += 1

    print("Список мешканців для кожної з квартир дорівнює:")
    for i in range(30):  # Виведення даних масиву array
        print(f"{i+1} квартира - {array[i]} осіб")

    for i in range(15):  # Обмін місцями відповідних перших та останніх елементів масиву array
        array[i], array[-i-1] = array[-i-1], array[i]

    print("Список мешканців для кожної з квартир з урахуванням переїзду мешканців будинку у квартири "
          "з тим же самим порядком, тільк з кінця, дорівнює:")
    for i in range(30):  # Виведення даних масиву array
        print(f"{i+1} квартира - {array[i]} осіб")

    print(f"Кількість квартир, в яких проживає більше ніж 5 осіб, дорівнює: {amount}.")

    answer = input("Введіть '1' для повторення:")
