
"""
Дан лінійний масив цілих чисел. Перевірте, чи є він упорядкованим по спаданню.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np


answer = '1'
while answer == '1':

    array, is_sorted = np.zeros(10, dtype=int), True  # array - масив із 10 заданих цілих чисел
    # is_sorted - змінна, яка приймає значення істинності, якщо масив array є упорядкованим за спаданням

    print("Введіть послідовність з 10 цілих чисел:")
    for i in range(10):  # Введення даних у масив array
        while True:
            try:
                item = int(input())
                break
            except ValueError:
                print("Вводьте правильні дані!")
        array[i] = item

    print("Задана послідовність чисел дорівнює: ", end="")
    for i in range(10):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 9:
            print(", ", end="")
        else:
            print(".")

        # Перевірка кожного елемента масиву array (окрім першого) на те, чи більший він за попередній елемент
        if array[i] > array[i-1] and i != 0:
            is_sorted = False  # Якщо елемент масиву більший за попередній елемент, то значення is_sorted стає хибою

    if is_sorted:  # Виведення відповідного тексту в залежності від значення is_sorted
        print("Задана послідовність чисел є упорядкованою за спаданням.")
    else:
        print("Задана послідовність чисел не є упорядкованою за спаданням.")

    answer = input("Введіть '1' для повторення:")
