"""
Лінійний масив містить відомості про кількість опадів, що випали за кожен з 12 місяців одного року.
Складіть програму, що визначає загальну кількість опадів протягом цього року, середньомісячну кількість опадів,
кількість посушливих місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    """ array - масив, який містить дані щодо кількості опадів, що випали за кожен з 12 місяців одного року.
    Значення масиву - 12 випадкових цілих чисел від 5 до 200.
    
    num_sum - загальна кількість опадів протягом всього року.
    dry_month_num - кількість посушливих місяців (коли кількість опадів було менше 30 мм).
    driest_month - кількість опадів найпосушливішого місяця року.
    driest_month_index - найпосушливіший місяць року."""
    array, num_sum, dry_month_num, driest_month_index, driest_month = np.random.randint(5, 200, 12), \
                                                                      0, 0, 0, 200

    print("Список кількості опадів, що випали за кожен з 12 місяців одного року, дорівнює: ")
    for i in range(12):  # Виведення даних масиву array
        print(f"{i + 1} місяць: {array[i]} мм")

        num_sum += array[i]  # Знаходження значень змінних num_sum, dry_month_num, driest_month_index
        if array[i] < 30:
            dry_month_num += 1
        if array[i] < driest_month:
            driest_month = array[i]
            driest_month_index = i + 1
    arithmetic_mean = round(num_sum / 12, 2)  # arithmetic_mean - середньомісячна кількість опадів.
    # Виведення значень змінних num_sum, arithmetic_mean, dry_month_num, driest_month_index
    print(f"Загальна кількість опадів протягом цього року дорівнює: {num_sum} мм.\n"
          f"Середньомісячна кількість опадів дорвівнює: {arithmetic_mean} мм.\n"
          f"Кількість посушливих місяців дорвівнює: {dry_month_num}.\n"
          f"Найпосушливішим місяцем року є: {driest_month_index} місяць.")

    answer = input("Введіть '1' для повторення:")
