
"""
Знайти добуток елементів масиву цілих чисел, які кратні 7.
Розмірність масиву - 15. Заповнення масиву здійснити випадковими числами від 10 до 50.

Виконав Іваненко Андрій Вадимович
"""

import numpy as np

answer = '1'
while answer == '1':

    array, num_product = np.random.randint(10, 50, 15), 1  # array - масив із 15 випадкових цілих чисел від 10 до 50
    # num_product - добуток елементів масиву array, які кратні 7

    print("Послідовність з 15 випадкових чисел від 10 до 50 дорівнює: ", end="")
    for i in range(15):  # Виведення даних масиву array
        print(array[i], end="")
        if i != 14:
            print(", ", end="")

        if array[i] % 7 == 0:  # Підрахунок значення num_product
            num_product *= array[i]
    """ Для проведення підрахунку добутку початкове значення num_product має дорівнювати одиниці.
    Якщо масив не містить в собі чисел, кратних 7, то добуток залише значення 1, яке не допустиме, тому
    відбувається перевірка на рівність num_product одиниці та вивід відповідного тексту."""
    if num_product == 1:  # Виведення значення num_product
        print("\nЦя послідовність не включає в собі чисел, кратних 7.")
    else:
        print(f"\nДобуток всіх чисел послідовності, які кратні 7, дорівнює: {num_product}")

    answer = input("Введіть '1' для повторення:")
